package main

//Задание 1. С какими интерфейсами мы уже сталкивались в предыдущих уроках?
// Обратите внимание на уроки, в которых мы читали из стандартного ввода и писали в стандартный вывод.
// в предыдущих заданиях мы сталкивались с интерфейсами из библиотек fmt - Scan, os - Exit, io - Writter, Reader

//Задание 2. Посмотрите примеры кода в своём портфолио.
//Везде ли ошибки обрабатываются грамотно? Хотите ли вы переписать какие-либо функции?
// стоит переписать места для ввода и вывода данных на код
// contents, err := Scan(&a)
//if err != nil {
// 		fmt.Println('Error occured')
//} else {
//	.....
//}
